[
  {
    "question_number": 1,
    "paper": "GS2",
    "year": 2024,
    "subject": "Polity",
    "question": "Examine the need for electoral reforms as suggested by various committees with particular reference to 'one nation – one election' principle.",
    "marks": 10,
    "level": "Moderate",
    "keywords": ["electoral reforms", "committees", "one nation one election"],
    "directive": "Examine",
    "topics_to_be_studied": [
      "Meaning and need for electoral reforms",
      "Issues in current electoral system: frequent elections, MCC impact, expenses, governance disruption",
      "Concept of One Nation, One Election",
      "Law Commission Reports (170th Report)",
      "NITI Aayog proposal on simultaneous elections",
      "Recommendations by Election Commission of India (ECI)",
      "Punchhi Commission on Centre-State relations and elections",
      "Challenges to implementation: constitutional, logistical, federal concerns",
      "Case studies from Indian states or global examples (e.g., South Africa)"
    ],
    "sources": [
      "Indian Polity by Laxmikanth – Chapter on Election Commission",
      "PRS India Reports on Electoral Reforms",
      "Law Commission of India – 170th Report",
      "NITI Aayog Discussion Paper on Simultaneous Elections",
      "ARC Reports and Yojana/Kurukshetra articles"
    ],
    "answer_framework": {
      "intro": "Briefly introduce the issue of frequent elections and need for reform.",
      "body": {
        "part1": "Challenges due to current electoral cycle: cost, MCC, governance lag",
        "part2": "Key committee recommendations (Law Commission, NITI Aayog, ECI)",
        "part3": "Arguments for and against One Nation – One Election principle"
      },
      "conclusion": "Reforms are essential for stability and cost-effectiveness, but require political consensus and constitutional amendments."
    },
    "linked_current_issues": [
      "2023 Committee chaired by Ram Nath Kovind on One Nation One Election",
      "2024 General Elections cost debates",
      "Model Code of Conduct-related governance halts"
    ],
    "word_limit": 150
  },
  {
    "question_number": 2,
    "paper": "GS2",
    "year": 2024,
    "subject": "Polity",
    "question": "Explain and distinguish between Lok Adalats and Arbitration Tribunals. Whether they entertain civil as well as criminal cases?",
    "marks": 10,
    "level": "Moderate",
    "keywords": [
      "Lok Adalat",
      "Arbitration Tribunal",
      "civil cases",
      "criminal cases",
      "difference"
    ],
    "directive": "Explain and distinguish",
    "topics_to_be_studied": [
      "Lok Adalat: Legal Services Authorities Act, 1987",
      "Jurisdiction, procedure, nature of cases handled by Lok Adalats",
      "Types of cases Lok Adalat handles: civil, compoundable criminal, pre-litigation",
      "Arbitration Tribunals: Arbitration and Conciliation Act, 1996",
      "Voluntary arbitration, binding decisions, private dispute resolution",
      "Key differences: legal status, formality, enforceability, scope",
      "Recent case studies and NALSA statistics"
    ],
    "sources": [
      "Indian Polity by M. Laxmikanth – Chapter on Judiciary and Alternate Dispute Redressal (ADR)",
      "Legal Services Authorities Act, 1987",
      "Arbitration and Conciliation Act, 1996",
      "PRS India Brief on ADR mechanisms",
      "NALSA official website for Lok Adalat data"
    ],
    "answer_framework": {
      "intro": "Brief introduction to Alternate Dispute Resolution (ADR) mechanisms in India.",
      "body": {
        "part1": "Define Lok Adalats and Arbitration Tribunals with relevant legal backing",
        "part2": "Key differences in composition, procedure, legal enforceability, types of cases",
        "part3": "Clarify scope: Lok Adalat handles civil + compoundable criminal; Arbitration only civil/commercial disputes"
      },
      "conclusion": "Both play complementary roles in reducing court burden, but differ significantly in structure and jurisdiction."
    },
    "linked_current_issues": [
      "Recent National Lok Adalat settlements and data from 2023–24",
      "NITI Aayog emphasis on arbitration for business ease"
    ],
    "word_limit": 150
  },
  {
    "question_number": 3,
    "paper": "GS2",
    "year": 2024,
    "subject": "Polity",
    "question": "“The growth of cabinet system has practically resulted in the marginalisation of the parliamentary supremacy.” Elucidate.",
    "marks": 10,
    "level": "Difficult",
    "keywords": [
      "cabinet system",
      "parliamentary supremacy",
      "marginalisation"
    ],
    "directive": "Elucidate",
    "topics_to_be_studied": [
      "Parliamentary system of government in India (Articles 74–75)",
      "Role and powers of Cabinet in parliamentary democracy",
      "Concept of collective responsibility",
      "Parliamentary sovereignty vs executive dominance",
      "Functioning of the legislature: Question Hour, Debates, No Confidence Motions",
      "Decline in legislative scrutiny and ordinances",
      "Role of PMO and Cabinet Committees",
      "Judicial observations on parliamentary role and executive accountability"
    ],
    "sources": [
      "Indian Polity by M. Laxmikanth – Chapter on Parliament and Cabinet System",
      "2nd ARC Report on Ethics in Governance",
      "PRS India Reports on Parliamentary Performance",
      "Editorials from The Hindu, Indian Express on Executive dominance",
      "Constitution of India – Articles 74, 75, 77"
    ],
    "answer_framework": {
      "intro": "Define the Cabinet system and its constitutional positioning in Indian polity.",
      "body": {
        "part1": "Explain how Cabinet exercises real executive power; Parliament is often seen as a forum for ratification",
        "part2": "Illustrate with examples: Ordinances, reduced sessions, limited debate, PMO centralisation",
        "part3": "Mention loss of legislative supremacy in practical terms (not legal terms)"
      },
      "conclusion": "Restoring balance requires stronger committees, robust debate, and enhanced legislative oversight."
    },
    "linked_current_issues": [
      "Frequent use of ordinances bypassing Parliament",
      "Low number of parliamentary sittings in recent years",
      "2022–24 debates on PMO centralization"
    ],
    "word_limit": 150
  },
  {
    "question_number": 4,
    "paper": "GS2",
    "year": 2024,
    "subject": "Polity",
    "question": "“The duty of the Comptroller and Auditor General is not merely to ensure the legality of expenditure but also its propriety.” Comment.",
    "marks": 10,
    "level": "Moderate",
    "keywords": [
      "Comptroller and Auditor General",
      "legality",
      "propriety",
      "expenditure",
      "audit"
    ],
    "directive": "Comment",
    "topics_to_be_studied": [
      "Article 148 to 151 – Role and powers of CAG",
      "Legal audit vs Propriety audit",
      "Difference between legality (as per rules/law) and propriety (wisdom, fairness, public interest)",
      "Examples of CAG reports (e.g., 2G, coal block allocations)",
      "CAG's role in accountability and good governance",
      "Limitations and criticisms of CAG audits"
    ],
    "sources": [
      "Indian Polity by M. Laxmikanth – Chapter on CAG",
      "CAG India official website – Audit reports and FAQs",
      "2nd ARC Report on Ethics in Governance",
      "Yojana/Kurukshetra articles on financial accountability",
      "Vision IAS / ForumIAS value-added material on audit institutions"
    ],
    "answer_framework": {
      "intro": "State the constitutional role of the CAG in India’s financial accountability framework.",
      "body": {
        "part1": "Explain legality of expenditure: whether as per sanctioned rules",
        "part2": "Explain propriety: whether the expenditure was necessary, wise, and justifiable",
        "part3": "Use examples where expenditure was legal but lacked propriety (e.g., extravagant spending, under-utilised assets)"
      },
      "conclusion": "CAG’s dual role in legality and propriety strengthens fiscal discipline and ensures public money is spent wisely."
    },
    "linked_current_issues": [
      "Recent CAG audit reports on state/central schemes (2022–2024)",
      "CAG observations on underutilisation of MPLADS or CSR funds"
    ],
    "word_limit": 150
  },
  {
    "question_number": 5,
    "paper": "GS2",
    "year": 2024,
    "subject": "Governance",
    "question": "Analyse the role of local bodies in providing good governance at local level and bring out the pros and cons merging the rural local bodies with the urban local bodies.",
    "marks": 10,
    "level": "Moderate",
    "keywords": [
      "local bodies",
      "good governance",
      "rural local bodies",
      "urban local bodies",
      "merging",
      "pros and cons"
    ],
    "directive": "Analyse and bring out",
    "topics_to_be_studied": [
      "73rd and 74th Constitutional Amendments",
      "Structure and functions of PRIs and ULBs",
      "Principles of good governance at local level (transparency, accountability, responsiveness)",
      "Case studies: Kerala (Panchayat), Bengaluru (BBMP structure), Delhi urban planning",
      "Concept and feasibility of rural–urban body merger",
      "Examples from metropolitan regions where peri-urban and rural overlap",
      "Challenges: capacity, planning conflicts, representation, fund devolution"
    ],
    "sources": [
      "Indian Polity by Laxmikanth – Chapters on Panchayati Raj and Urban Local Bodies",
      "2nd ARC Report – Local Governance",
      "NITI Aayog and MoPR documents",
      "Yojana and Kurukshetra magazine issues on decentralisation",
      "Ministry of Panchayati Raj & Ministry of Housing and Urban Affairs websites"
    ],
    "answer_framework": {
      "intro": "Highlight the constitutional status of local bodies post-73rd and 74th Amendments as vehicles of grassroots governance.",
      "body": {
        "part1": "Explain how local bodies ensure good governance: citizen participation, service delivery, accountability",
        "part2": "Discuss potential benefits of merging: unified planning, better resource use, rural–urban continuum",
        "part3": "List drawbacks: governance complexity, loss of identity, bureaucratic overload, representation issues"
      },
      "conclusion": "Balanced approach needed — promote integration where viable while respecting functional specialisation of rural and urban needs."
    },
    "linked_current_issues": [
      "Smart Cities vs Gram Panchayat resource allocation debates",
      "Urban expansion into rural peripheries (e.g., Gurugram, Bengaluru outskirts)",
      "Digitalisation of local governance – eGramSwaraj, SBM Urban vs Rural"
    ],
    "word_limit": 150
  },
  {
    "question_number": 6,
    "paper": "GS2",
    "year": 2024,
    "subject": "Governance",
    "question": "Public charitable trusts have the potential to make India’s development more inclusive as they relate to certain vital public issues. Comment.",
    "marks": 10,
    "level": "Moderate",
    "keywords": [
      "public charitable trusts",
      "inclusive development",
      "public issues"
    ],
    "directive": "Comment",
    "topics_to_be_studied": [
      "Definition and legal status of public charitable trusts",
      "Role in delivering social services: education, health, livelihood",
      "Contribution to inclusive development (reaching marginalized sections)",
      "Examples of prominent public trusts (e.g., Tata Trusts, Azim Premji Foundation)",
      "Challenges: regulatory oversight, transparency, accountability",
      "Relation to Article 19(1)(c) and CSR under Companies Act"
    ],
    "sources": [
      "Ministry of Corporate Affairs – CSR Policy guidelines",
      "Trusts Act and Societies Registration Act overview",
      "NITI Aayog reports on NGO and civil society contributions",
      "Yojana/Kurukshetra articles on inclusive development",
      "Relevant editorials or PRS policy briefs"
    ],
    "answer_framework": {
      "intro": "Introduce the concept of public charitable trusts as non-profit entities working for public welfare.",
      "body": {
        "part1": "Explain their contributions to inclusive growth: targeting underprivileged communities, supplementing govt efforts",
        "part2": "Mention how they address vital issues: education, health, environment, gender equality",
        "part3": "Discuss challenges and need for regulation to enhance credibility and impact"
      },
      "conclusion": "With proper support and transparency, public trusts can be vital partners in India’s inclusive development journey."
    },
    "linked_current_issues": [
      "Debates around FCRA regulation and transparency of NGOs",
      "CSR initiatives of large public/private trusts during COVID-19",
      "Digital public goods and philanthropy-led interventions in rural education"
    ],
    "word_limit": 150
  },
  {
    "question_number": 7,
    "paper": "GS2",
    "year": 2024,
    "subject": "Social Justice",
    "question": "Poverty and malnutrition create a vicious cycle, adversely affecting human capital formation. What steps can be taken to break the cycle?",
    "marks": 10,
    "level": "Easy to Moderate",
    "keywords": [
      "poverty",
      "malnutrition",
      "vicious cycle",
      "human capital formation",
      "steps"
    ],
    "directive": "What steps can be taken",
    "topics_to_be_studied": [
      "Causes and impact of poverty and malnutrition",
      "Human capital: health, education, skill development",
      "Intergenerational cycle of deprivation",
      "POSHAN Abhiyaan and ICDS",
      "Mid-Day Meal / PM POSHAN",
      "Ayushman Bharat and public health schemes",
      "Skilling initiatives like PMKVY",
      "Cash transfers, DBT and MGNREGA",
      "NITI Aayog recommendations on nutrition and education"
    ],
    "sources": [
      "NCERT Class 11 Economics – Human Capital Formation",
      "PIB – Ministry of Women and Child Development",
      "India Year Book – Social Sector",
      "Economic Survey – Social Sector Chapter",
      "Yojana / Kurukshetra articles on Nutrition and Poverty Alleviation"
    ],
    "answer_framework": {
      "intro": "Explain the vicious cycle: poverty leads to malnutrition which impairs learning and productivity, reinforcing poverty.",
      "body": {
        "part1": "Government interventions in nutrition (POSHAN, ICDS), education (PM SHRI, NEP), and healthcare (Ayushman Bharat)",
        "part2": "Employment and income support (MGNREGA, DBT, Self Help Groups)",
        "part3": "Convergent and decentralised delivery of welfare services"
      },
      "conclusion": "A multi-sectoral, sustained effort is essential to break the intergenerational cycle and boost India’s human capital."
    },
    "linked_current_issues": [
      "NFHS-5 data on child and maternal nutrition",
      "NITI Aayog SDG India Index",
      "Global Hunger Index controversy and India's response"
    ],
    "word_limit": 150
  },
  {
    "question_number": 8,
    "paper": "GS2",
    "year": 2024,
    "subject": "Governance",
    "question": "The Doctrine of Democratic Governance makes it necessary that the public perception of the integrity and commitment of civil servants becomes absolutely positive. Discuss.",
    "marks": 10,
    "level": "Moderate",
    "keywords": [
      "Democratic Governance",
      "civil servants",
      "integrity",
      "public perception",
      "commitment"
    ],
    "directive": "Discuss",
    "topics_to_be_studied": [
      "Doctrine of Democratic Governance",
      "Role of civil services in a democracy",
      "Ethical values in public administration: integrity, impartiality, commitment",
      "Citizen–government relationship and trust",
      "Reforms in civil services: performance appraisal, lateral entry, code of conduct",
      "Accountability mechanisms: RTI, Lokpal, citizen charters"
    ],
    "sources": [
      "2nd ARC Report on Ethics in Governance",
      "Indian Polity by M. Laxmikanth – Civil Services chapter",
      "Reports from Department of Administrative Reforms (DARPG)",
      "Vision/Forum value-added notes on Governance",
      "Yojana/Kurukshetra on public service ethics"
    ],
    "answer_framework": {
      "intro": "Define democratic governance and the importance of trust in civil services.",
      "body": {
        "part1": "Why civil servant integrity and commitment matter: public trust, policy execution, responsiveness",
        "part2": "How perception influences governance legitimacy",
        "part3": "Steps needed: ethical training, transparent performance review, public interface, whistleblower protection"
      },
      "conclusion": "In a democracy, public perception is not just reflective but constitutive of legitimacy—making civil service integrity foundational to good governance."
    },
    "linked_current_issues": [
      "Discussions on lateral entry and bureaucratic reform",
      "Cases of misconduct and media scrutiny of officials",
      "Citizen surveys on trust in government institutions"
    ],
    "word_limit": 150
  },
  {
    "question_number": 9,
    "paper": "GS2",
    "year": 2024,
    "subject": "International Relations",
    "question": "‘The West is fostering India as an alternative to reduce dependence on China’s supply chain and as a strategic ally to counter China’s political and economic dominance.’ Explain this statement with examples.",
    "marks": 10,
    "level": "Moderate to Difficult",
    "keywords": [
      "India",
      "China",
      "supply chain",
      "strategic ally",
      "West",
      "geopolitics",
      "economic dominance"
    ],
    "directive": "Explain",
    "topics_to_be_studied": [
      "India–China–US strategic triangle",
      "Quad (India, US, Japan, Australia) and Indo-Pacific policy",
      "China Plus One strategy by Western nations",
      "India’s role in global supply chain resilience",
      "Technology partnerships (e.g., semiconductors, defence, AI)",
      "FTA negotiations and trade realignments post-COVID",
      "India's Act East and Neighbourhood First policies"
    ],
    "sources": [
      "MEA Annual Reports",
      "PIB releases on QUAD, iCET, and FTAs",
      "Yojana articles on Foreign Policy and Indo-Pacific",
      "The Hindu / Indian Express international editorial analysis",
      "IDSA and ORF commentaries on strategic autonomy"
    ],
    "answer_framework": {
      "intro": "Mention the shifting global geopolitical dynamics post-COVID and increasing distrust toward China’s trade monopoly.",
      "body": {
        "part1": "India as a democratic, stable alternative to Chinese manufacturing – 'China Plus One' strategy",
        "part2": "Strategic alignments: QUAD, Indo-Pacific, iCET (with US), EU-India ties",
        "part3": "Examples: Apple shifting assembly to India, India–EU Trade talks, defence cooperation with France/USA"
      },
      "conclusion": "India's rise as a trusted global partner complements its strategic autonomy and economic diplomacy goals."
    },
    "linked_current_issues": [
      "QUAD initiatives on supply chain resilience",
      "India–US iCET agreement and semiconductor cooperation",
      "2023 Apple iPhone manufacturing shift to India"
    ],
    "word_limit": 150
  },
  {
    "question_number": 10,
    "paper": "GS2",
    "year": 2024,
    "subject": "International Relations",
    "question": "Critically analyse India’s evolving diplomatic, economic and strategic relations with the Central Asian Republics (CARs) highlighting their increasing significance in regional and global geopolitics.",
    "marks": 10,
    "level": "Moderate to Difficult",
    "keywords": [
      "Central Asian Republics",
      "India-CARs relations",
      "diplomacy",
      "strategy",
      "geopolitics",
      "regional importance"
    ],
    "directive": "Critically analyse",
    "topics_to_be_studied": [
      "India's Connect Central Asia Policy (2012)",
      "India-Central Asia Dialogue mechanisms",
      "Chabahar Port and INSTC (International North–South Transport Corridor)",
      "Energy ties and civilizational links",
      "CARs’ strategic position near Afghanistan, Iran, Russia, China",
      "Challenges: China’s BRI dominance, lack of direct connectivity",
      "Geopolitical significance: SCO, Taliban-Afghan issue, counter-terrorism"
    ],
    "sources": [
      "MEA website – Central Asia Division",
      "IDSA/ORF analyses on India–CAR relations",
      "PIB releases on India–Central Asia Summits",
      "Yojana / Kurukshetra articles on Neighbourhood and Extended Neighbourhood",
      "International Relations textbooks – India’s Foreign Policy"
    ],
    "answer_framework": {
      "intro": "Introduce CARs’ importance as India's extended neighbourhood with rising strategic value.",
      "body": {
        "part1": "Diplomatic: high-level visits, India–Central Asia Dialogue, SCO platform",
        "part2": "Economic: trade via INSTC, energy partnerships (oil/gas pipelines)",
        "part3": "Strategic: counter-terrorism cooperation, security balancing against China’s BRI, soft power",
        "part4": "Challenges: China’s deep economic presence, connectivity limitations"
      },
      "conclusion": "India’s multi-vector engagement with CARs must be intensified to secure regional balance and energy interests amid evolving global geopolitics."
    },
    "linked_current_issues": [
      "India–Central Asia Dialogue 2023–24",
      "SCO summit outcomes and regional security",
      "Increased India–Iran–Russia cooperation on INSTC"
    ],
    "word_limit": 150
  },
  {
    "question_number": 11,
    "paper": "GS2",
    "year": 2024,
    "subject": "Governance",
    "question": "What are the aims and objects of recently passed and enforced, The Public Examination (Prevention of Unfair Means) Act, 2024? Whether University/State Education Board examinations, too, are covered under the Act?",
    "marks": 15,
    "level": "Moderate",
    "keywords": [
      "Public Examination Act 2024",
      "unfair means",
      "education reform",
      "university exams",
      "state board exams"
    ],
    "directive": "Explain",
    "topics_to_be_studied": [
      "Salient features of Public Examination (Prevention of Unfair Means) Act, 2024",
      "Aims: prevent leaks, impersonation, unfair practices",
      "Scope of the Act: competitive exams (UPSC, SSC, etc.)",
      "Penalties and legal provisions under the Act",
      "Responsibility of service providers, officials",
      "Ambit of coverage: whether it includes university/state board exams",
      "Education governance and examination integrity"
    ],
    "sources": [
      "Ministry of Education – Press Information Bureau (PIB) brief",
      "Text of the Public Examination Act, 2024",
      "PRS India Bill Summary",
      "Editorials in The Hindu / Indian Express",
      "Rajya Sabha TV Debates / Sansad TV Analysis"
    ],
    "answer_framework": {
      "intro": "Mention the increasing instances of exam leaks and the need for a legal framework to curb unfair means.",
      "body": {
        "part1": "Aims and objects of the Act: ensure exam integrity, prevent organized cheating, protect aspirants’ future",
        "part2": "Key provisions: offences defined, criminal penalties, institutional accountability",
        "part3": "Clarify scope – covers central public examinations, not university or state boards unless notified separately"
      },
      "conclusion": "The Act is a step towards transparent governance and safeguarding meritocracy in public recruitment; states and universities may need aligned frameworks."
    },
    "linked_current_issues": [
      "Paper leaks in SSC and other public recruitment exams",
      "Demand to expand coverage to state board and university exams",
      "Debate on centralisation vs state autonomy in education governance"
    ],
    "word_limit": 250
  },
  {
    "question_number": 12,
    "paper": "GS2",
    "year": 2024,
    "subject": "Polity",
    "question": "Right to privacy is intrinsic to life and personal liberty and is inherently protected under Article 21 of the Constitution. Explain. In this reference discuss the law relating to D.N.A. testing of child in the womb to establish its paternity.",
    "marks": 15,
    "level": "Difficult",
    "keywords": [
      "right to privacy",
      "Article 21",
      "personal liberty",
      "DNA testing",
      "paternity",
      "foetus",
      "constitutional law"
    ],
    "directive": "Explain and discuss",
    "topics_to_be_studied": [
      "Article 21: Protection of life and personal liberty",
      "Justice K.S. Puttaswamy v. Union of India (2017) – Right to Privacy as a fundamental right",
      "Medical Termination of Pregnancy Act (in context)",
      "Guidelines and restrictions on prenatal testing (Pre-Conception and Pre-Natal Diagnostic Techniques Act, 1994)",
      "Supreme Court judgments on forced DNA testing and privacy infringement",
      "Balancing privacy vs state interest in justice and paternity disputes",
      "Consent and bodily autonomy in prenatal cases"
    ],
    "sources": [
      "Constitution of India – Article 21",
      "Landmark judgments: K.S. Puttaswamy (2017), Goutam Kundu v. State of West Bengal (1993), Rohit Shekhar v. Narayan Dutt Tiwari",
      "PRS India – Privacy Law and DNA Testing analysis",
      "The Hindu / Indian Express – Editorials on bodily autonomy and reproductive rights",
      "Law Commission Reports (relevant excerpts)"
    ],
    "answer_framework": {
      "intro": "Define Article 21 and its expansion through judicial interpretation to include the right to privacy.",
      "body": {
        "part1": "Explain the significance of privacy in personal bodily decisions and medical information, citing Puttaswamy judgment",
        "part2": "Discuss DNA testing in the womb – legal and ethical dimensions, role of consent, medical and judicial safeguards",
        "part3": "Mention balancing act between individual rights and legitimate state interest in paternity disputes"
      },
      "conclusion": "While DNA testing may serve justice in certain contexts, it must be pursued within the framework of dignity, privacy, and informed consent to uphold constitutional values."
    },
    "linked_current_issues": [
      "Supreme Court rulings on DNA tests and marital disputes",
      "Debate on right to bodily autonomy and state intrusion",
      "Delayed legislation on privacy/data protection"
    ],
    "word_limit": 250
  },
  {
    "question_number": 13,
    "paper": "GS2",
    "year": 2024,
    "subject": "Polity",
    "question": "What changes has the Union Government recently introduced in the domain of Centre–State relations? Suggest measures to be adopted to build the trust between the Centre and the States and for strengthening federalism.",
    "marks": 15,
    "level": "Moderate",
    "keywords": [
      "Centre-State relations",
      "federalism",
      "Union Government",
      "trust",
      "cooperative federalism",
      "constitutional mechanisms"
    ],
    "directive": "Suggest and Explain",
    "topics_to_be_studied": [
      "Article 245–263: Distribution of powers (legislative, administrative, financial)",
      "Recent trends: Centralised policy imposition, GST compensation delay, NEP implementation disputes",
      "Role of Inter-State Council, Zonal Councils, NITI Aayog",
      "Debates on Governor’s role and Article 356",
      "Principles of cooperative and competitive federalism",
      "Finance Commission recommendations",
      "Supreme Court judgments on state autonomy"
    ],
    "sources": [
      "Indian Polity by M. Laxmikanth – Centre-State Relations",
      "2nd ARC Report – Centre-State Relations",
      "NITI Aayog reports on federalism",
      "The Hindu / Indian Express – editorials on GST disputes, language policy, Governor controversies",
      "Yojana issues on federalism and governance"
    ],
    "answer_framework": {
      "intro": "India’s quasi-federal structure demands a dynamic balance between Union and States to ensure smooth governance.",
      "body": {
        "part1": "Recent changes: GST regime centralisation, fiscal transfers, national schemes overriding state autonomy",
        "part2": "Trust issues: unilateral policy decisions, under-utilisation of Inter-State Council, politicisation of Governor’s office",
        "part3": "Suggestions: strengthen fiscal federalism, regular ISC meetings, consensus-building mechanisms, code of conduct for Governors, decentralised planning"
      },
      "conclusion": "A truly cooperative federal model is vital for democratic deepening and inclusive development across diverse regions."
    },
    "linked_current_issues": [
      "GST compensation delays",
      "NEP 2020 language disputes",
      "Tamil Nadu and Kerala Governor controversies",
      "Debates on 16th Finance Commission and fiscal centralisation"
    ],
    "word_limit": 250
  },
  {
    "question_number": 14,
    "paper": "GS2",
    "year": 2024,
    "subject": "Polity",
    "question": "Explain the reasons for the growth of public interest litigation in India. As a result of it, has the Indian Supreme Court emerged as the world’s most powerful judiciary?",
    "marks": 15,
    "level": "Moderate",
    "keywords": [
      "public interest litigation",
      "PIL",
      "Supreme Court",
      "judicial activism",
      "constitutional remedies",
      "access to justice"
    ],
    "directive": "Explain",
    "topics_to_be_studied": [
      "Concept and origin of PIL in India – Hussainara Khatoon case, 1980s",
      "Expansion of Article 32 and 226 powers",
      "Judicial activism vs judicial overreach",
      "Growth of PIL due to civil society involvement, corruption, environmental concerns, human rights",
      "Supreme Court’s role as policy influencer and social justice facilitator",
      "Global comparison – limited jurisdiction in UK/US vs India’s expansive role"
    ],
    "sources": [
      "Indian Polity by M. Laxmikanth – Supreme Court and PIL section",
      "Landmark judgments: Vishaka case, MC Mehta, Olga Tellis",
      "The Hindu / Indian Express – judicial activism editorials",
      "Law Commission reports",
      "2nd ARC Report – Ethics and Governance"
    ],
    "answer_framework": {
      "intro": "Define PIL as an instrument for ensuring justice to voiceless sections through judicial intervention.",
      "body": {
        "part1": "Reasons for PIL growth: public spirited citizens, NGO involvement, media influence, accessible legal procedures",
        "part2": "Impact on Indian judiciary: enhanced public trust, expanded reach, strong enforcement capacity",
        "part3": "Compare with global courts – SC’s wide jurisdiction and suo motu powers"
      },
      "conclusion": "While the SC’s activism through PIL has strengthened its authority, balance is needed to avoid judicial overreach and uphold constitutional sanctity."
    },
    "linked_current_issues": [
      "Debates on judicial overreach",
      "Suo motu PILs during COVID-19 lockdown",
      "Environmental and social justice PILs in 2023–24"
    ],
    "word_limit": 250
  },
  {
    "question_number": 15,
    "paper": "GS2",
    "year": 2024,
    "subject": "Polity",
    "question": "Discuss India as a secular state and compare with the secular principles of the US constitution.",
    "marks": 15,
    "level": "Moderate",
    "keywords": [
      "secular state",
      "India",
      "US constitution",
      "comparative constitutionalism",
      "religious freedom",
      "state neutrality"
    ],
    "directive": "Discuss and compare",
    "topics_to_be_studied": [
      "Preamble of Indian Constitution – Secularism",
      "Articles 25–28: Freedom of religion",
      "Indian model of secularism: Equal respect to all religions",
      "US model: 'Wall of separation' between Church and State",
      "Judicial interpretation: Kesavananda Bharati, S.R. Bommai vs Union of India",
      "Indian context: religious pluralism, communal harmony",
      "Debates on uniform civil code and religion-based laws"
    ],
    "sources": [
      "Indian Polity by M. Laxmikanth – Chapter on Fundamental Rights and Secularism",
      "Constitution of India – Articles 25 to 28",
      "U.S. Constitution – First Amendment",
      "Judgments: S.R. Bommai Case, Kesavananda Bharati Case",
      "Yojana / The Hindu articles on comparative secularism"
    ],
    "answer_framework": {
      "intro": "Define secularism and its constitutional status in India and the US.",
      "body": {
        "part1": "India – Positive secularism: state maintains principled distance but engages with all religions",
        "part2": "USA – Negative secularism: strict separation of state and religion",
        "part3": "Compare approach, legal provisions, and real-world applications (e.g., religious symbols, funding)"
      },
      "conclusion": "While both uphold religious freedom, India’s inclusive and diverse model contrasts with the US’s non-engagement approach, each shaped by historical context."
    },
    "linked_current_issues": [
      "Debates on UCC in India",
      "Supreme Court judgments on religious freedom vs state policy",
      "Religious freedom cases in the US (e.g., dress code, education)"
    ],
    "word_limit": 250
  },
  {
    "question_number": 16,
    "paper": "GS2",
    "year": 2024,
    "subject": "Governance",
    "question": "The Citizens’ charter has been a landmark initiative in ensuring citizen-centric administration. But it is yet to reach its full potential. Identify the factors hindering the realisation of its promise and suggest measures to overcome them.",
    "marks": 15,
    "level": "Moderate",
    "keywords": [
      "Citizens' charter",
      "citizen-centric governance",
      "public service delivery",
      "accountability",
      "implementation challenges"
    ],
    "directive": "Identify and suggest",
    "topics_to_be_studied": [
      "Concept and purpose of the Citizens' Charter",
      "Sevottam Model and public service standards",
      "RTI Act, e-governance, and administrative accountability",
      "Challenges: lack of awareness, poor enforcement, bureaucratic resistance, non-binding nature",
      "Citizen engagement in governance",
      "Best practices from states and countries (e.g., UK model)"
    ],
    "sources": [
      "2nd ARC Report on Citizen-Centric Administration",
      "DARPG Guidelines on Citizens’ Charter",
      "Vision IAS Governance Notes",
      "Yojana / Kurukshetra articles on service delivery and citizen empowerment",
      "Indian Express / The Hindu editorials"
    ],
    "answer_framework": {
      "intro": "Introduce the concept of the Citizens’ Charter as a tool to promote transparency, accountability, and service standards in governance.",
      "body": {
        "part1": "List the intended goals and benefits of the Charter",
        "part2": "Identify hindrances: poor design, lack of legal enforceability, limited citizen awareness, weak grievance redressal",
        "part3": "Suggest reforms: legal backing, regular audits, digitisation, citizen feedback loops, performance-linked evaluation"
      },
      "conclusion": "Citizens’ Charters can be truly transformative if backed by institutional commitment, continuous monitoring, and citizen participation."
    },
    "linked_current_issues": [
      "DARPG initiatives for e-Sevottam certification",
      "Digital public services in India Stack",
      "Debates on service-level agreements and time-bound delivery (e.g., Public Service Guarantee Acts)"
    ],
    "word_limit": 250
  },
  {
    "question_number": 17,
    "paper": "GS2",
    "year": 2024,
    "subject": "Social Justice",
    "question": "In a crucial domain like the public healthcare system the Indian State should play a vital role to contain the adverse impact of marketisation of the system. Suggest some measures through which the State can enhance the reach of public healthcare at the grassroots level.",
    "marks": 15,
    "level": "Moderate",
    "keywords": [
      "public healthcare",
      "marketisation",
      "Indian State",
      "grassroots",
      "health equity",
      "universal health coverage"
    ],
    "directive": "Suggest",
    "topics_to_be_studied": [
      "Right to health under Article 21 and DPSPs",
      "Challenges of privatisation and rising health costs",
      "Ayushman Bharat and Health & Wellness Centres",
      "Health infrastructure at PHC/CHC level",
      "Shortage of doctors and paramedics",
      "Digital health initiatives (eSanjeevani, ABHA)",
      "State capacity and public spending on health"
    ],
    "sources": [
      "Economic Survey – Chapter on Health Sector",
      "National Health Policy 2017",
      "NITI Aayog Health Index Reports",
      "The Hindu / Indian Express – editorials on public health access",
      "Yojana / Kurukshetra on grassroots healthcare delivery"
    ],
    "answer_framework": {
      "intro": "Mention that health is a public good and the increasing role of the private sector has raised access and affordability concerns.",
      "body": {
        "part1": "Adverse effects of marketisation: high out-of-pocket expenditure, rural neglect, inequality",
        "part2": "Measures: more budgetary allocation, strengthen primary health network, incentivise rural postings, use tech and telemedicine, PPPs with accountability, train ASHA/ANMs",
        "part3": "Ensure convergence with nutrition, sanitation, and education"
      },
      "conclusion": "A robust, equitable public healthcare system at the grassroots can counter market failures and ensure inclusive development."
    },
    "linked_current_issues": [
      "NSSO data on out-of-pocket health expenditure",
      "Performance of Health & Wellness Centres under Ayushman Bharat",
      "Debate on health as a justiciable right"
    ],
    "word_limit": 250
  },
  {
    "question_number": 18,
    "paper": "GS2",
    "year": 2024,
    "subject": "Governance",
    "question": "e-governance is not just about the routine application of digital technology in service delivery process. It is as much about multifarious interactions for ensuring transparency and accountability. In this context evaluate the role of the ‘Interactive Service Model’ of e-governance.",
    "marks": 15,
    "level": "Moderate",
    "keywords": [
      "e-governance",
      "interactive service model",
      "digital technology",
      "transparency",
      "accountability",
      "citizen engagement"
    ],
    "directive": "Evaluate",
    "topics_to_be_studied": [
      "Definition and objectives of e-governance",
      "UN’s four-stage e-governance model: Information, Interaction, Transaction, Transformation",
      "Interactive Service Model: participatory platforms, feedback systems, grievance redressal",
      "Digital India, MyGov, RTI portals, UMANG, eSanjeevani, DigiLocker",
      "Challenges: digital divide, capacity building, data protection"
    ],
    "sources": [
      "2nd ARC Report on e-Governance",
      "Digital India Programme – official documents",
      "Vision IAS / Forum IAS Governance notes",
      "Yojana / Kurukshetra on e-governance and transparency",
      "UN e-Government Survey reports"
    ],
    "answer_framework": {
      "intro": "Explain that e-governance has evolved from mere digitisation to citizen-centered interactive governance.",
      "body": {
        "part1": "Define the Interactive Service Model – two-way communication and citizen-government collaboration",
        "part2": "Examples: MyGov, CPGRAMS, mobile apps, citizen dashboards, online RTI filing",
        "part3": "Benefits: real-time feedback, policy responsiveness, inclusive governance"
      },
      "conclusion": "The interactive model transforms governance into a participatory, trust-building process, essential for democratic accountability in the digital era."
    },
    "linked_current_issues": [
      "Digital Public Infrastructure (DPI) focus under G20 Presidency",
      "Increased use of AI-enabled chatbots for public grievance redressal",
      "Jansamarth portal, eCourts, and One Nation One Ration Card system"
    ],
    "word_limit": 250
  },
  {
    "question_number": 19,
    "paper": "GS2",
    "year": 2024,
    "subject": "International Relations",
    "question": "‘Terrorism has become a significant threat to global peace and security.’ Evaluate the effectiveness of the United Nations Security Council’s Counter Terrorism Committee (CTC) and its associated bodies in addressing and mitigating this threat at the international level.",
    "marks": 15,
    "level": "Difficult",
    "keywords": [
      "terrorism",
      "global peace and security",
      "UNSC",
      "CTC",
      "international cooperation",
      "counter-terrorism"
    ],
    "directive": "Evaluate",
    "topics_to_be_studied": [
      "UNSC Resolution 1373 (2001) and the formation of the CTC",
      "Mandate and functions of the CTC",
      "UN Office of Counter-Terrorism (UNOCT)",
      "Global Counter-Terrorism Strategy",
      "Financial Action Task Force (FATF) coordination",
      "Limitations: lack of consensus on definition, veto politics, selective action",
      "India’s proposals on Comprehensive Convention on International Terrorism (CCIT)"
    ],
    "sources": [
      "UN Security Council – CTC official documents and resolutions",
      "PIB / MEA releases on India’s stance on global terrorism",
      "IDSA / ORF reports on multilateral counter-terror cooperation",
      "Yojana and The Hindu articles on UN reforms and global governance",
      "UN Global Counter-Terrorism Strategy (UNGA adopted)"
    ],
    "answer_framework": {
      "intro": "State the growing menace of terrorism as a cross-border, digital-age threat needing global response.",
      "body": {
        "part1": "Outline the formation and goals of the CTC and associated agencies",
        "part2": "Achievements: institutional coordination, support to national capacities, FATF cooperation, ISIL tracking",
        "part3": "Challenges: veto politics, lack of binding enforcement, failure to define terrorism uniformly"
      },
      "conclusion": "UNSC bodies have laid an institutional foundation, but need structural reforms and political will to be more effective in combating evolving terror threats."
    },
    "linked_current_issues": [
      "India’s 2022 UNSC Presidency and hosting of CTC special session",
      "Global terrorism financing and cyber radicalisation",
      "Calls for Comprehensive Convention on International Terrorism (CCIT)"
    ],
    "word_limit": 250
  },
  {
    "question_number": 20,
    "paper": "GS2",
    "year": 2024,
    "subject": "International Relations",
    "question": "Discuss the geopolitical and geostrategic importance of Maldives for India with a focus on global trade and energy flows. Further also discuss how this relationship affects India’s maritime security and regional stability amidst international competition.",
    "marks": 15,
    "level": "Moderate",
    "keywords": [
      "India-Maldives relations",
      "geopolitics",
      "energy flows",
      "maritime security",
      "regional stability",
      "Indo-Pacific",
      "strategic competition"
    ],
    "directive": "Discuss",
    "topics_to_be_studied": [
      "Geographical location of Maldives near major sea lanes of communication (SLOCs)",
      "India's SAGAR doctrine and neighbourhood-first policy",
      "Strategic presence in Indian Ocean – threats from China (string of pearls)",
      "Maritime infrastructure, radar and naval cooperation",
      "Energy imports and trade routes in Western Indian Ocean",
      "Recent political shifts in Maldives and strategic recalibration",
      "India’s role in regional security frameworks – IORA, Colombo Security Conclave"
    ],
    "sources": [
      "MEA annual reports on India–Maldives relations",
      "IDSA / ORF analysis on Indian Ocean geopolitics",
      "Yojana / Kurukshetra issues on Maritime Security and Blue Economy",
      "The Hindu / Indian Express editorials on Maldives–India tensions",
      "Maritime doctrines and SAGAR vision document"
    ],
    "answer_framework": {
      "intro": "Highlight Maldives’ location in Indian Ocean and proximity to India’s maritime trade routes.",
      "body": {
        "part1": "Discuss its role in global trade and energy shipping lanes – 80% of India’s energy imports",
        "part2": "Mention India's role in ensuring Maldives’ security (e.g., Operation Cactus, hydrographic surveys, training)",
        "part3": "Explain how China’s presence and recent ‘India Out’ campaigns affect India’s maritime strategy and regional leadership"
      },
      "conclusion": "India–Maldives ties are key to India’s strategic depth in the IOR and maintaining regional maritime balance in the face of rising global competition."
    },
    "linked_current_issues": [
      "‘India Out’ campaign in Maldives (2023–24)",
      "Chinese surveillance ships and naval agreements",
      "India–Maldives defence pact for coastal radar systems",
      "Maldives’ tilt towards China under new leadership"
    ],
    "word_limit": 250
  },
  {
    "question_number": 1,
    "paper": "GS2",
    "year": 2023,
    "subject": "Polity",
    "question": "“Constitutionally guaranteed judicial independence is a prerequisite of democracy.” Comment.",
    "marks": 10,
    "level": "Moderate",
    "keywords": [
      "judicial independence",
      "constitutional guarantee",
      "democracy",
      "separation of powers",
      "rule of law",
      "checks and balances",
      "judicial accountability"
    ],
    "directive": "Comment",
    "topics_to_be_studied": [
      "Features of Indian Constitution ensuring judicial independence (e.g., security of tenure, fixed service conditions, prohibition on practice after retirement)",
      "Doctrine of separation of powers",
      "Role of judiciary in upholding fundamental rights and rule of law",
      "Landmark cases like Kesavananda Bharati, S.P. Gupta, Second Judges Case, etc.",
      "Threats to judicial independence (executive interference, post-retirement appointments)",
      "Judicial accountability vs. judicial independence"
    ],
    "sources": [
      "Indian Polity by Laxmikanth – Chapter on Judiciary",
      "SC judgments and Law Commission reports",
      "ARC Reports (esp. 1st ARC on Judiciary)",
      "PRS Legislative Research on Judicial Appointments",
      "Editorials from The Hindu / Indian Express on judicial independence"
    ],
    "answer_framework": {
      "intro": "Define judicial independence and link it to democratic governance and constitutionalism.",
      "body": {
        "part1": "Explain how judiciary protects democratic values like fundamental rights, rule of law, and checks executive/legislative overreach.",
        "part2": "Discuss constitutional provisions and mechanisms that ensure judicial independence in India.",
        "part3": "Highlight recent concerns and debates around erosion of independence (e.g., appointments, delays, political pressure)."
      },
      "conclusion": "Judicial independence is not just a legal necessity but a moral and structural foundation of a healthy democracy."
    },
    "linked_current_issues": [
      "Debate on collegium vs. NJAC",
      "Allegations of judicial 'softness' towards executive",
      "Recent statements by SC and HC judges on independence",
      "Judges' post-retirement appointments"
    ]
  },
  {
    "question_number": 2,
    "paper": "GS2",
    "year": 2023,
    "subject": "Polity",
    "question": "Who are entitled to receive free legal aid? Assess the role of the National Legal Services Authority (NALSA) in rendering free legal aid in India.",
    "marks": 10,
    "level": "Easy",
    "keywords": [
      "free legal aid",
      "NALSA",
      "access to justice",
      "legal services",
      "Article 39A",
      "vulnerable sections"
    ],
    "directive": "Assess",
    "topics_to_be_studied": [
      "Article 39A and Directive Principles of State Policy",
      "Legal Services Authorities Act, 1987",
      "Eligibility criteria for free legal aid (SC/ST, women, children, disabled, poor, etc.)",
      "Functions and initiatives of NALSA – legal literacy, Lok Adalats, legal aid clinics",
      "Challenges faced by NALSA and state legal services authorities",
      "Impact of legal aid in strengthening rule of law and inclusive justice"
    ],
    "sources": [
      "Indian Polity by Laxmikanth – Chapter on Judiciary and DPSPs",
      "Legal Services Authorities Act, 1987",
      "NALSA official website and annual reports",
      "Reports and editorials in The Hindu / Indian Express",
      "Yojana/Kurukshetra articles on legal empowerment and access to justice"
    ],
    "answer_framework": {
      "intro": "Mention constitutional basis for free legal aid under Article 39A and its importance in ensuring justice for all.",
      "body": {
        "part1": "List categories of people entitled to free legal aid as per the Legal Services Authorities Act.",
        "part2": "Discuss the role and functions of NALSA in delivering free legal services across India.",
        "part3": "Highlight achievements, schemes (like Lok Adalats), and challenges faced by NALSA."
      },
      "conclusion": "NALSA is crucial for realising constitutional ideals of justice, equity, and inclusion in the legal system."
    },
    "linked_current_issues": [
      "Recent Lok Adalat performance data",
      "NALSA’s outreach during COVID-19 lockdown",
      "Push for digital legal services and e-Lok Adalats"
    ]
  },
  {
    "question_number": 3,
    "paper": "GS2",
    "year": 2023,
    "subject": "Polity",
    "question": "“The states in India seem reluctant to empower urban local bodies both functionally as well as financially.” Comment.",
    "marks": 10,
    "level": "Moderate",
    "keywords": [
      "urban local bodies",
      "financial empowerment",
      "functional autonomy",
      "74th Constitutional Amendment",
      "municipal governance",
      "decentralization"
    ],
    "directive": "Comment",
    "topics_to_be_studied": [
      "74th Constitutional Amendment Act and its provisions",
      "12th Schedule functions of urban local bodies",
      "State control over urban governance",
      "Financial constraints of ULBs – revenue sources, devolution issues",
      "Urbanisation and challenges in urban service delivery",
      "Role of State Finance Commissions and Central schemes (e.g., AMRUT, Smart Cities)"
    ],
    "sources": [
      "Indian Polity by Laxmikanth – Chapter on Urban Local Government",
      "Second ARC Report on Local Governance",
      "Reports from Ministry of Housing and Urban Affairs",
      "Economic Survey – chapter on Urban Development",
      "Editorials from The Hindu / Indian Express on urban decentralisation"
    ],
    "answer_framework": {
      "intro": "Highlight the importance of empowered urban local bodies in a rapidly urbanising India.",
      "body": {
        "part1": "Explain how states retain control over functions and finances of ULBs, limiting their autonomy.",
        "part2": "Discuss examples of poor implementation of 74th Amendment – lack of staff, funds, control over subjects.",
        "part3": "Highlight the need for true decentralisation and fiscal empowerment to meet urban governance demands."
      },
      "conclusion": "Strengthening ULBs is key to democratic decentralisation and improving urban service delivery amid growing urbanisation."
    },
    "linked_current_issues": [
      "Smart Cities Mission underperformance",
      "State Finance Commissions delay in fund devolution",
      "World Bank studies on India’s urban finance gap",
      "NITI Aayog’s push for municipal bonds and fiscal discipline in ULBs"
    ]
  },
  {
    "question_number": 4,
    "paper": "GS2",
    "year": 2023,
    "subject": "Polity",
    "question": "Compare and contrast the British and Indian approaches to Parliamentary sovereignty.",
    "marks": 10,
    "level": "Moderate",
    "keywords": [
      "Parliamentary sovereignty",
      "British Parliament",
      "Indian Parliament",
      "constitutional supremacy",
      "judicial review",
      "basic structure doctrine"
    ],
    "directive": "Compare and contrast",
    "topics_to_be_studied": [
      "Meaning and scope of Parliamentary sovereignty in UK (supremacy of Parliament)",
      "Nature of Indian Parliament's powers – subject to the Constitution",
      "Role of judiciary and basic structure doctrine in India",
      "Difference between unwritten UK Constitution and written Indian Constitution",
      "Amendability of Constitution – UK vs India"
    ],
    "sources": [
      "Indian Polity by Laxmikanth – Chapter on Parliament and Constitutional Amendments",
      "Comparative constitutions – UK vs India (Political Science books)",
      "Supreme Court judgments – Kesavananda Bharati, Minerva Mills",
      "The Hindu / Indian Express editorials on parliamentary powers and constitutional limits"
    ],
    "answer_framework": {
      "intro": "Define Parliamentary sovereignty and its theoretical basis in UK and India.",
      "body": {
        "part1": "Discuss British approach – Parliament as supreme law-making body, no constitutional limits.",
        "part2": "Discuss Indian approach – Parliament is powerful but not supreme; constrained by Constitution and judiciary.",
        "part3": "Highlight judicial review, constitutional supremacy, and basic structure doctrine in India."
      },
      "conclusion": "While India inherited elements of British system, constitutionalism and judicial safeguards limit absolute sovereignty in India."
    },
    "linked_current_issues": [
      "Debates on Constitutional amendments and limits of legislative power",
      "Judiciary–legislature tussles (e.g., NJAC case)",
      "Basic structure doctrine reaffirmed in recent rulings"
    ]
  },
  {
    "question_number": 5,
    "paper": "GS2",
    "year": 2023,
    "subject": "Polity",
    "question": "Discuss the role of Presiding Officers of state legislatures in maintaining order and impartiality in conducting legislative work and in facilitating best democratic practices.",
    "marks": 10,
    "level": "Moderate",
    "keywords": [
      "Presiding Officers",
      "State legislatures",
      "impartiality",
      "legislative work",
      "democratic practices",
      "Speaker",
      "Chairman",
      "Rule of law"
    ],
    "directive": "Discuss",
    "topics_to_be_studied": [
      "Constitutional roles and powers of Speaker and Chairman in State Legislatures (Articles 178–187)",
      "Functions related to maintaining decorum, discipline, and procedure in the House",
      "Role in ensuring impartiality, especially in anti-defection cases (Tenth Schedule)",
      "Recent controversies around misuse of presiding officer’s power",
      "Need for codified conventions and reforms (e.g., time-bound disqualification rulings)"
    ],
    "sources": [
      "Indian Polity by Laxmikanth – Chapter on State Legislature",
      "Second ARC Report on Ethics in Governance",
      "PRS Legislative Research on legislative conduct and disqualification",
      "The Hindu / Indian Express editorials on Speaker's impartiality and Assembly disruptions",
      "Constitution of India – Articles 178, 179, 212, and 194"
    ],
    "answer_framework": {
      "intro": "Highlight the importance of Presiding Officers in ensuring smooth functioning and democratic ethos in legislatures.",
      "body": {
        "part1": "Discuss constitutional duties – maintaining order, allotting time, allowing debates, ensuring decorum.",
        "part2": "Explain the expectation of neutrality, especially in sensitive matters like anti-defection.",
        "part3": "Discuss challenges – partisanship, delayed decisions, recent controversies, and need for reforms."
      },
      "conclusion": "Presiding Officers must uphold democratic values and impartiality to strengthen legislative institutions and public trust."
    },
    "linked_current_issues": [
      "Maharashtra and Arunachal Pradesh Assembly disqualification cases",
      "Debates on giving Speaker’s anti-defection powers to an independent authority",
      "Frequent disruptions in State Assemblies"
    ]
  },
  {
    "question_number": 6,
    "paper": "GS2",
    "year": 2023,
    "subject": "Governance",
    "question": "The crucial aspect of development process has been the inadequate attention paid to Human Resource Development in India. Suggest measures that can address this inadequacy.",
    "marks": 10,
    "level": "Moderate",
    "keywords": [
      "Human Resource Development",
      "inadequacy",
      "education",
      "health",
      "skilling",
      "demographic dividend",
      "inclusive development"
    ],
    "directive": "Suggest",
    "topics_to_be_studied": [
      "Definition and importance of Human Resource Development (HRD)",
      "Status of education and healthcare in India",
      "Skill development initiatives – Skill India, PMKVY, NEP 2020",
      "Issues like brain drain, unemployability, health infrastructure gaps",
      "Government schemes and policy gaps",
      "Role of public-private partnership and institutional reforms"
    ],
    "sources": [
      "Economic Survey – chapters on Human Capital and Education",
      "NITI Aayog Human Development Reports",
      "Yojana / Kurukshetra issues on Skill Development, Education, and Health",
      "Government websites: MHRD, Ministry of Skill Development",
      "The Hindu / Indian Express editorials on demographic dividend and HRD"
    ],
    "answer_framework": {
      "intro": "Define Human Resource Development and mention its centrality to sustainable development and growth.",
      "body": {
        "part1": "Highlight gaps – low investment in education/health, skill mismatch, regional disparity.",
        "part2": "Suggest measures – universal access to quality education, vocational training, healthcare reforms, digital learning, industry-academia linkage.",
        "part3": "Mention successful models or schemes and how to scale or reform them."
      },
      "conclusion": "Focusing on HRD will enable India to harness its demographic dividend and ensure inclusive growth."
    },
    "linked_current_issues": [
      "Low GER in higher education",
      "ASER Report findings on learning outcomes",
      "Implementation of National Education Policy (NEP) 2020",
      "Global Human Capital Index rankings"
    ]
  },
  {
    "question_number": 7,
    "paper": "GS2",
    "year": 2023,
    "subject": "Governance",
    "question": "Discuss the role of the Competition Commission of India in containing the abuse of dominant position by the Multi-National Corporations in India. Refer to the recent decisions.",
    "marks": 10,
    "level": "Moderate",
    "keywords": [
      "Competition Commission of India",
      "abuse of dominant position",
      "multi-national corporations",
      "anti-competitive practices",
      "market regulation",
      "recent decisions"
    ],
    "directive": "Discuss",
    "topics_to_be_studied": [
      "Competition Act, 2002 – provisions on anti-competitive practices and abuse of dominance",
      "Role, powers, and functions of the Competition Commission of India (CCI)",
      "Notable CCI cases: Google Android case, Amazon-Future Retail, Apple App Store policies, etc.",
      "Impact on digital economy, e-commerce, and consumer welfare",
      "Challenges faced by CCI in regulating big tech and global MNCs",
      "Need for competition reforms in evolving market landscape"
    ],
    "sources": [
      "Official website of CCI (competitioncommission.gov.in)",
      "Economic Survey – chapter on regulatory bodies",
      "Yojana / Kurukshetra issues on governance and regulation",
      "The Hindu / Indian Express editorials on digital markets and CCI rulings",
      "PRS Legislative Research – overview of Competition Amendment Bill"
    ],
    "answer_framework": {
      "intro": "Briefly explain the objective of CCI – ensuring fair competition and curbing abuse of dominance.",
      "body": {
        "part1": "Explain mechanisms under Competition Act to deal with abuse of dominance by MNCs.",
        "part2": "Refer to recent decisions against tech giants (Google, Amazon, etc.) and their significance.",
        "part3": "Mention challenges – legal delays, global jurisdiction, data asymmetry, need for tech expertise."
      },
      "conclusion": "CCI plays a vital role in maintaining a level playing field and protecting consumer interest in a liberalised and digital economy."
    },
    "linked_current_issues": [
      "CCI's penalty on Google for Android dominance (2022)",
      "CCI's probe into Apple’s App Store policies",
      "Merger control in e-commerce and retail sector",
      "Competition (Amendment) Act, 2023"
    ]
  },
  {
    "question_number": 8,
    "paper": "GS2",
    "year": 2023,
    "subject": "Governance",
    "question": "e-governance, as a critical tool of governance, has ushered in effectiveness, transparency and accountability in governments. What inadequacies hamper the enhancement of these features?",
    "marks": 10,
    "level": "Easy",
    "keywords": [
      "e-governance",
      "effectiveness",
      "transparency",
      "accountability",
      "digital governance",
      "public service delivery",
      "ICT in governance"
    ],
    "directive": "What",
    "topics_to_be_studied": [
      "Definition and scope of e-governance",
      "Impact of e-governance on transparency, accountability, and efficiency",
      "National e-Governance Plan (NeGP), Digital India initiative",
      "Challenges: digital divide, poor infrastructure, low digital literacy, data privacy concerns, bureaucratic resistance",
      "Best practices from states (e.g., e-seva, Bhulekh, UMANG, eCourts)",
      "Way forward: digital capacity-building, cyber security, inclusive access"
    ],
    "sources": [
      "2nd ARC Report on e-Governance",
      "Digital India policy documents",
      "Yojana/Kurukshetra issues on e-Governance and Digital India",
      "Economic Survey – governance and technology chapters",
      "The Hindu / Indian Express editorials on digital inclusion and public service delivery"
    ],
    "answer_framework": {
      "intro": "Mention how e-governance improves transparency, accountability, and effectiveness in modern public administration.",
      "body": {
        "part1": "Explain achievements of e-governance initiatives (online services, reduced corruption, citizen engagement).",
        "part2": "Discuss inadequacies: access inequality, lack of digital literacy, interoperability issues, cyber threats.",
        "part3": "Highlight need for reforms: last-mile connectivity, user-friendly interfaces, data protection frameworks."
      },
      "conclusion": "To unlock full potential of e-governance, systemic digital infrastructure and inclusive outreach must be strengthened."
    },
    "linked_current_issues": [
      "Digital Personal Data Protection Act, 2023",
      "Cybersecurity issues in government portals",
      "Status of Digital India targets",
      "India’s performance in UN e-Government Development Index"
    ]
  },
  {
    "question_number": 9,
    "paper": "GS2",
    "year": 2023,
    "subject": "International Relations",
    "question": "‘Virus of Conflict is affecting the functioning of the SCO.’ In the light of the above statement, point out the role of India in mitigating the problems.",
    "marks": 10,
    "level": "Moderate",
    "keywords": [
      "SCO",
      "Shanghai Cooperation Organisation",
      "India's role",
      "conflict mitigation",
      "regional security",
      "multilateral diplomacy"
    ],
    "directive": "Point out",
    "topics_to_be_studied": [
      "Structure, objectives, and functioning of SCO",
      "Recent internal conflicts within SCO – India-China, Russia-West, China-Pakistan influence",
      "India’s strategic interests in SCO (energy, connectivity, counter-terrorism, regional stability)",
      "India’s role in promoting multilateral cooperation and non-interference",
      "India’s balanced diplomatic approach amid geopolitical tensions",
      "SCO Summit 2023 highlights and India’s presidency"
    ],
    "sources": [
      "MEA website and press releases on SCO",
      "IDSA and ORF analysis on India-SCO engagement",
      "The Hindu / Indian Express editorials on SCO geopolitics",
      "PIB coverage of SCO 2023 Summit hosted by India",
      "International Relations textbooks and Yearbook references"
    ],
    "answer_framework": {
      "intro": "Briefly explain the relevance of SCO in regional geopolitics and how internal rivalries are impeding its effectiveness.",
      "body": {
        "part1": "Explain the nature of conflicts – Sino-Indian border, Russia-Ukraine, and Pakistan’s role.",
        "part2": "Highlight India's initiatives – dialogue facilitation, focus on counter-terrorism, digital cooperation, connectivity.",
        "part3": "Discuss India’s diplomatic balancing, economic engagement, and promotion of SCO’s foundational principles."
      },
      "conclusion": "India’s constructive and non-aligned approach is essential for restoring cooperation and effectiveness within SCO."
    },
    "linked_current_issues": [
      "India’s 2023 SCO Presidency and Virtual Summit",
      "India-China border tensions",
      "Russia-Ukraine war impact on SCO unity",
      "India’s resistance to China’s BRI agenda within SCO"
    ]
  },
  {
    "question_number": 10,
    "paper": "GS2",
    "year": 2023,
    "subject": "International Relations",
    "question": "Indian diaspora has scaled new heights in the West. Describe its economic and political benefits for India.",
    "marks": 10,
    "level": "Easy",
    "keywords": [
      "Indian diaspora",
      "economic benefits",
      "political influence",
      "remittances",
      "soft power",
      "foreign policy"
    ],
    "directive": "Describe",
    "topics_to_be_studied": [
      "Role of diaspora in India's foreign policy and bilateral relations",
      "Economic benefits – remittances, investments, startup ecosystem, technology transfer",
      "Political influence – lobbying, diaspora diplomacy, soft power",
      "Success stories – CEOs, lawmakers, academics shaping opinion in host countries",
      "Government initiatives – Pravasi Bharatiya Divas, OCI, MEA engagement strategies",
      "Challenges – dual loyalty, rising Hinduphobia, radical elements"
    ],
    "sources": [
      "MEA Annual Reports on diaspora",
      "IDSA and ORF papers on diaspora diplomacy",
      "Economic Survey – data on remittances",
      "Yojana / Kurukshetra on migration and diaspora engagement",
      "The Hindu / Indian Express editorials on diaspora influence"
    ],
    "answer_framework": {
      "intro": "Briefly mention how the Indian diaspora in the West has gained prominence in business, technology, and politics.",
      "body": {
        "part1": "Economic benefits – remittances (top globally), FDI, technology and knowledge transfer.",
        "part2": "Political benefits – advocacy for Indian interests, support in host country parliaments, countering anti-India narratives.",
        "part3": "Government efforts to engage diaspora and leverage their achievements."
      },
      "conclusion": "The diaspora acts as a bridge between India and the West, amplifying India’s voice globally while contributing to its economic rise."
    },
    "linked_current_issues": [
      "Indian-origin leaders in US, UK, Canada",
      "Record remittance inflows in 2022-23",
      "India-US diaspora tech corridor",
      "Concerns about Khalistani influence among select diaspora groups"
    ]
  },
  {
    "question_number": 11,
    "paper": "GS2",
    "year": 2023,
    "subject": "Polity",
    "question": "“The Constitution of India is a living instrument with capabilities of enormous dynamism. It is a constitution made for a progressive society.” Illustrate with special reference to the expanding horizons of the right to life and personal liberty.",
    "marks": 15,
    "level": "Moderate",
    "keywords": [
      "living constitution",
      "dynamism",
      "progressive society",
      "right to life",
      "personal liberty",
      "Article 21",
      "judicial interpretation"
    ],
    "directive": "Illustrate",
    "topics_to_be_studied": [
      "Concept of living constitution and constitutional dynamism",
      "Judicial interpretations of Article 21 – right to life and personal liberty",
      "Expanding scope – right to privacy, dignity, education, clean environment, legal aid, etc.",
      "Key judgments – Maneka Gandhi, K.S. Puttaswamy, Vishaka, Navtej Singh Johar, Common Cause",
      "Judicial activism vs. judicial overreach debate",
      "Preamble and DPSPs as guiding tools for progressive interpretation"
    ],
    "sources": [
      "Indian Polity by Laxmikanth – Fundamental Rights and Judiciary chapters",
      "Landmark SC judgments (Maneka Gandhi, Puttaswamy, etc.)",
      "The Hindu / Indian Express editorials on constitutional morality and progressive jurisprudence",
      "Law Commission reports",
      "Yojana/Kurukshetra on Constitution and Rights"
    ],
    "answer_framework": {
      "intro": "Introduce the idea of the Indian Constitution as a dynamic document, adapting to changing times and societal needs.",
      "body": {
        "part1": "Explain the concept of a ‘living Constitution’ and role of judiciary in expanding its interpretation.",
        "part2": "Discuss how Article 21 evolved to include various rights beyond mere animal existence.",
        "part3": "Cite landmark cases and implications for progressive realization of rights in India."
      },
      "conclusion": "The dynamic interpretation of Article 21 exemplifies how the Constitution serves a progressive society, ensuring justice, dignity, and equality."
    },
    "linked_current_issues": [
      "Debates on euthanasia, privacy, and same-sex marriage",
      "Application of right to life in digital age and surveillance",
      "Climate justice as part of Article 21",
      "Recent SC rulings affirming dignity and autonomy"
    ]
  },
  {
    "question_number": 12,
    "paper": "GS2",
    "year": 2023,
    "subject": "Polity",
    "question": "Explain the constitutional perspectives of Gender Justice with the help of relevant Constitutional Provisions and case laws.",
    "marks": 15,
    "level": "Moderate",
    "keywords": [
      "gender justice",
      "constitutional provisions",
      "equality",
      "case laws",
      "discrimination",
      "women's rights"
    ],
    "directive": "Explain",
    "topics_to_be_studied": [
      "Articles 14, 15, 16, 21 and Directive Principles (Articles 39, 42, 51A(e))",
      "Preamble and constitutional vision of equality and justice",
      "Landmark judgments – Vishaka v. State of Rajasthan, Shayara Bano (Triple Talaq), Joseph Shine (Adultery), Navtej Singh Johar, NALSA case",
      "Laws and policies promoting gender justice – Maternity Benefit Act, POSH Act, etc.",
      "Challenges in realization – patriarchal norms, implementation gaps"
    ],
    "sources": [
      "Indian Polity by Laxmikanth – Fundamental Rights and DPSPs",
      "Supreme Court judgments on gender rights",
      "Law Commission reports on women and equality",
      "The Hindu / Indian Express editorials on gender justice",
      "Yojana / Kurukshetra on Women Empowerment and Gender Equality"
    ],
    "answer_framework": {
      "intro": "Define gender justice and link it to the constitutional commitment of equality and dignity.",
      "body": {
        "part1": "Mention relevant constitutional provisions that support gender justice.",
        "part2": "Explain key case laws that have interpreted and expanded gender rights.",
        "part3": "Discuss institutional mechanisms and laws supporting gender justice and persistent challenges."
      },
      "conclusion": "Gender justice is foundational to India’s democratic ethos and requires both legal safeguards and societal change."
    },
    "linked_current_issues": [
      "Debate on Uniform Civil Code",
      "Supreme Court rulings on same-sex marriage and marital rape exceptions",
      "Women’s reservation in legislatures (Women's Reservation Bill)",
      "Gender budgeting and SDG-5 implementation"
    ]
  },
  {
    "question_number": 13,
    "paper": "GS2",
    "year": 2023,
    "subject": "Polity",
    "question": "Account for the legal and political factors responsible for the reduced frequency of using Article 356 by the Union Governments since mid 1990s.",
    "marks": 15,
    "level": "Moderate",
    "keywords": [
      "Article 356",
      "President's Rule",
      "legal safeguards",
      "political misuse",
      "federalism",
      "judicial review"
    ],
    "directive": "Account for",
    "topics_to_be_studied": [
      "Constitutional provision: Article 356 and its conditions for invocation",
      "Misuse of Article 356 pre-1990s for political gains",
      "Landmark judgment: S.R. Bommai v. Union of India (1994)",
      "Rise of coalition politics and regional parties post-1990s",
      "Role of judiciary in ensuring federal balance",
      "Recommendations of Sarkaria and Punchhi Commissions"
    ],
    "sources": [
      "Indian Polity by Laxmikanth – Chapter on Centre-State Relations",
      "S.R. Bommai case summary and its implications",
      "2nd ARC and Punchhi Commission Reports",
      "The Hindu / Indian Express editorials on federalism and misuse of Article 356",
      "Constitution of India – Article 356"
    ],
    "answer_framework": {
      "intro": "Briefly explain the original intent and controversial history of Article 356.",
      "body": {
        "part1": "Discuss misuse of Article 356 in post-independence India until the 1980s.",
        "part2": "Explain legal restraints post S.R. Bommai judgment – judicial review, floor test mandate.",
        "part3": "Mention political changes – coalition era, federal assertions, stronger judiciary and civil society."
      },
      "conclusion": "The decline in Article 356 usage reflects maturing democracy, strengthened federalism, and judicial oversight."
    },
    "linked_current_issues": [
      "Occasional invocation of Article 356 in recent years (e.g., Arunachal, Uttarakhand, Maharashtra)",
      "Judicial interventions in floor tests and Assembly dissolution",
      "Debates around Governor’s role and Centre-State dynamics"
    ]
  },
  {
    "question_number": 14,
    "paper": "GS2",
    "year": 2023,
    "subject": "Governance",
    "question": "Discuss the contribution of civil society groups for women’s effective and meaningful participation and representation in state legislatures in India.",
    "marks": 15,
    "level": "Moderate",
    "keywords": [
      "civil society",
      "women's participation",
      "state legislatures",
      "political representation",
      "gender equality",
      "empowerment"
    ],
    "directive": "Discuss",
    "topics_to_be_studied": [
      "Role of civil society in democracy and empowerment",
      "Barriers to women’s political participation – social, economic, cultural",
      "Advocacy and awareness campaigns by NGOs and women's rights organizations",
      "Training and leadership development programs for aspiring women leaders",
      "Contribution to electoral reforms, women’s reservation debates, and accountability",
      "Success stories and impact at local/state level"
    ],
    "sources": [
      "Reports by UN Women and National Commission for Women",
      "Yojana / Kurukshetra on Women Empowerment and Civil Society",
      "Indian Express / The Hindu editorials on women's representation",
      "NGO case studies (e.g., SEWA, Jagori, Centre for Social Research)",
      "NITI Aayog reports on SDG-5 and governance indicators"
    ],
    "answer_framework": {
      "intro": "Briefly introduce the importance of women’s representation in state legislatures for inclusive governance.",
      "body": {
        "part1": "Explain the barriers to women's participation in politics.",
        "part2": "Discuss the role played by civil society – training, sensitization, capacity building, legal advocacy.",
        "part3": "Highlight case examples or impact assessments from specific states or organizations."
      },
      "conclusion": "Civil society acts as a vital enabler in bridging gender gaps in political representation, complementing state efforts."
    },
    "linked_current_issues": [
      "Debate and passage of Women’s Reservation Bill",
      "Women’s under-representation in state assemblies",
      "Grassroots movements for Panchayati Raj inclusion scaling up to state levels",
      "SDG-5 (Gender Equality) progress reports"
    ]
  },
  {
    "question_number": 15,
    "paper": "GS2",
    "year": 2023,
    "subject": "Polity",
    "question": "Explain the significance of the 101st Constitutional Amendment Act. To what extent does it reflect the accommodative spirit of federalism?",
    "marks": 15,
    "level": "Moderate",
    "keywords": [
      "101st Constitutional Amendment",
      "GST",
      "cooperative federalism",
      "fiscal federalism",
      "federal structure",
      "GST Council"
    ],
    "directive": "Explain",
    "topics_to_be_studied": [
      "Provisions of 101st Constitutional Amendment Act – introduction of GST, GST Council, amendment of Seventh Schedule",
      "Impact on Centre-State fiscal relations",
      "Role and functioning of GST Council – consensus-based decision-making",
      "Cooperative and competitive federalism – harmonisation of tax structure",
      "Challenges in implementation – compensation issues, state autonomy concerns"
    ],
    "sources": [
      "Indian Polity by Laxmikanth – Constitutional Amendments and Federalism chapters",
      "Economic Survey – GST-related chapters",
      "PIB summary and text of the 101st Constitutional Amendment Act",
      "The Hindu / Indian Express editorials on GST and federalism",
      "Yojana/Kurukshetra issues on fiscal federalism"
    ],
    "answer_framework": {
      "intro": "Mention the background and importance of GST reform leading to the 101st Amendment.",
      "body": {
        "part1": "Explain key provisions of the 101st Amendment – GST Council, concurrent taxing powers, integrated market.",
        "part2": "Discuss how the GST framework embodies cooperative federalism and consensus building.",
        "part3": "Mention tensions and challenges – compensation delays, demands for greater state autonomy."
      },
      "conclusion": "The 101st Amendment showcases India’s evolving federalism, where negotiation and cooperation are key to national integration and policy reforms."
    },
    "linked_current_issues": [
      "Debates over GST compensation to states",
      "GST Council decisions on rate rationalisation",
      "Judicial comments on the binding nature of GST Council",
      "Discussion on improving federal fiscal balance post-COVID"
    ]
  },
  {
    "question_number": 16,
    "paper": "GS2",
    "year": 2023,
    "subject": "Polity",
    "question": "Explain the structure of the Parliamentary Committee system. How far have the financial committees helped in the institutionalisation of Indian Parliament?",
    "marks": 15,
    "level": "Moderate",
    "keywords": [
      "Parliamentary Committees",
      "financial committees",
      "institutionalisation",
      "Public Accounts Committee",
      "Estimates Committee",
      "Committee on Public Undertakings"
    ],
    "directive": "Explain / How far",
    "topics_to_be_studied": [
      "Types of Parliamentary Committees – Standing and Ad Hoc",
      "Structure of financial committees – PAC, Estimates Committee, Committee on Public Undertakings",
      "Role in legislative scrutiny, budget oversight, ensuring accountability",
      "Impact on transparency, efficiency, and institutional strength of Parliament",
      "Challenges – politicisation, lack of binding authority, attendance issues"
    ],
    "sources": [
      "Indian Polity by Laxmikanth – Chapter on Parliamentary Committees",
      "PRS Legislative Research briefs on committee functioning",
      "Reports from PAC and Estimates Committees",
      "The Hindu / Indian Express editorials on Parliament's role and reforms",
      "Rajya Sabha and Lok Sabha Secretariat documents"
    ],
    "answer_framework": {
      "intro": "Mention the importance of the committee system in enabling detailed parliamentary work beyond the floor of the House.",
      "body": {
        "part1": "Describe the classification and structure of Parliamentary Committees – Standing (Departmental, Financial) and Ad Hoc.",
        "part2": "Explain the role of financial committees in budget oversight, audit review, and policy accountability.",
        "part3": "Assess their contribution to strengthening parliamentary democracy and oversight, with examples."
      },
      "conclusion": "The committee system, especially financial committees, has institutionalised Parliament by deepening scrutiny and reinforcing accountability mechanisms."
    },
    "linked_current_issues": [
      "Debates on reforming committee procedures and digitisation",
      "PAC completing 100 years (2021) and its relevance",
      "Underutilisation of reports and recommendations by executive"
    ]
  },
  {
    "question_number": 17,
    "paper": "GS2",
    "year": 2023,
    "subject": "Governance",
    "question": "“Development and welfare schemes for the vulnerable, by its nature, are discriminatory in approach.” Do you agree? Give reasons for your answer.",
    "marks": 15,
    "level": "Moderate",
    "keywords": [
      "welfare schemes",
      "vulnerable sections",
      "discriminatory approach",
      "affirmative action",
      "inclusive governance",
      "social justice"
    ],
    "directive": "Do you agree? Give reasons",
    "topics_to_be_studied": [
      "Targeted welfare policies vs. universal schemes",
      "Constitutional vision of social justice and equity",
      "Affirmative action and positive discrimination – rationale and ethics",
      "Examples: SC/ST/OBC/EWS reservations, PMAY, PMJAY, scholarships, pension schemes",
      "Debate on merit vs. social equity, exclusion errors, political economy of welfare",
      "Impact of such schemes on empowerment and development outcomes"
    ],
    "sources": [
      "Indian Polity by Laxmikanth – DPSPs and Equality chapters",
      "Yojana / Kurukshetra on social justice and welfare",
      "The Hindu / Indian Express editorials on targeted subsidies and exclusion",
      "Economic Survey – welfare scheme assessments",
      "NITI Aayog SDG Index and Aspirational Districts Programme"
    ],
    "answer_framework": {
      "intro": "Define the nature of welfare schemes for vulnerable groups and introduce the debate on whether they are inherently discriminatory or not.",
      "body": {
        "part1": "Arguments for the statement – targeted schemes exclude others, may distort equality before law.",
        "part2": "Arguments against – equity ≠ equality; affirmative action corrects historical injustice and systemic marginalisation.",
        "part3": "Use constitutional morality, examples of empowerment outcomes, and global parallels (e.g., USA’s affirmative action)."
      },
      "conclusion": "Such schemes are not discriminatory but essential tools for equitable development and inclusive growth in a socially diverse society like India."
    },
    "linked_current_issues": [
      "Debate on EWS reservation (103rd Amendment)",
      "Concerns around exclusion in PM-KISAN, PMJAY, and DBT",
      "Supreme Court observations on merit vs. social justice",
      "Socio-Economic Caste Census (SECC) data and welfare planning"
    ]
  },
  {
    "question_number": 18,
    "paper": "GS2",
    "year": 2023,
    "subject": "Governance",
    "question": "Skill development programmes have succeeded in increasing human resources supply to various sectors. In the context of the statement analyse the linkages between education, skill and employment.",
    "marks": 15,
    "level": "Moderate",
    "keywords": [
      "skill development",
      "education",
      "employment",
      "human resources",
      "demographic dividend",
      "labour market"
    ],
    "directive": "Analyse",
    "topics_to_be_studied": [
      "Role of education in human capital formation",
      "Vocational and skill development programmes – PMKVY, Skill India, ITIs, NSDC",
      "Mismatch between education and employability",
      "Need for convergence of education policy with employment market needs",
      "New Education Policy 2020 – emphasis on skilling and experiential learning",
      "Youth unemployment and underemployment trends"
    ],
    "sources": [
      "Economic Survey – Human Capital and Employment chapters",
      "NITI Aayog reports on skill development and job creation",
      "Yojana / Kurukshetra – issues on Skill India and education reforms",
      "Ministry of Skill Development and Entrepreneurship data",
      "The Hindu / Indian Express editorials on jobless growth and skilling gaps"
    ],
    "answer_framework": {
      "intro": "Mention India’s demographic potential and the increasing emphasis on skill development to boost employability.",
      "body": {
        "part1": "Explain the linkage between education and skill development – foundational learning to applied capability.",
        "part2": "Discuss how skilling enables transition from education to employment; cite flagship schemes.",
        "part3": "Analyse gaps – quality of training, alignment with industry needs, need for integrated policy approach."
      },
      "conclusion": "Harmonising education, skill development, and employment ecosystems is essential to realise India’s demographic dividend."
    },
    "linked_current_issues": [
      "Periodic Labour Force Survey (PLFS) reports on youth unemployment",
      "Criticism of PMKVY outcomes",
      "NEP 2020 implementation progress",
      "Skill India Mission’s evolving roadmap"
    ]
  },
  {
    "question_number": 19,
    "paper": "GS2",
    "year": 2023,
    "subject": "International Relations",
    "question": "‘The expansion and strengthening of NATO and a stronger US-Europe strategic partnership works well for India.’ What is your opinion about this statement? Give reasons and examples to support your answer.",
    "marks": 15,
    "level": "Moderate",
    "keywords": [
      "NATO",
      "US-Europe partnership",
      "India’s strategic interests",
      "geopolitics",
      "Indo-Pacific",
      "multipolarity"
    ],
    "directive": "Give your opinion",
    "topics_to_be_studied": [
      "NATO’s evolving role post-Ukraine war",
      "India’s relations with US, EU, and strategic implications",
      "Impact of Western alliances on Russia-China axis",
      "India’s balancing act in a multipolar world – strategic autonomy",
      "Cooperation with NATO countries in defence, tech, counter-terrorism",
      "Constraints – India not a NATO ally, historical ties with Russia"
    ],
    "sources": [
      "MEA Annual Reports on bilateral and multilateral ties",
      "ORF / IDSA papers on NATO and India’s foreign policy",
      "The Hindu / Indian Express editorials on transatlantic partnerships and Indo-Pacific strategy",
      "Yojana / Kurukshetra issues on global order and India's strategic outlook",
      "Statements by Indian officials in Raisina Dialogue or Munich Security Conference"
    ],
    "answer_framework": {
      "intro": "Briefly outline NATO’s strategic relevance and recent resurgence, and its impact on global geopolitics.",
      "body": {
        "part1": "Arguments supporting the statement – check on China, defence collaboration, rule-based order, tech and trade cooperation.",
        "part2": "Counterpoints – NATO focus remains Euro-Atlantic, possible strain on India-Russia relations, India not a member.",
        "part3": "India’s strategic balancing – leveraging QUAD, I2U2, G20, and bilateral defence ties with US & EU."
      },
      "conclusion": "While not directly aligned, a stable and strong transatlantic partnership can indirectly benefit India’s global aspirations if it maintains its strategic autonomy."
    },
    "linked_current_issues": [
      "India-US defence deals (GE jet engine, drones)",
      "India-EU Trade and Technology Council",
      "NATO’s outreach to Indo-Pacific partners",
      "Russia-Ukraine war and India’s diplomatic position"
    ]
  },
  {
    "question_number": 20,
    "paper": "GS2",
    "year": 2023,
    "subject": "International Relations",
    "question": "‘Sea is an important Component of the Cosmos’ Discuss in the light of the above statement the role of the IMO (International Maritime Organisation) in protecting environment and enhancing maritime safety and security.",
    "marks": 15,
    "level": "Moderate",
    "keywords": [
      "IMO",
      "International Maritime Organisation",
      "maritime safety",
      "marine environment",
      "UNCLOS",
      "shipping regulations"
    ],
    "directive": "Discuss",
    "topics_to_be_studied": [
      "Role and structure of IMO as a UN specialized agency",
      "IMO conventions – MARPOL, SOLAS, Ballast Water Management, STCW, etc.",
      "Environmental protection – oil pollution, ship emissions, ballast water discharge",
      "Maritime safety – navigation standards, seafarer training, accident prevention",
      "IMO’s role in global shipping governance and sustainable development (SDG 14)",
      "India’s engagement with IMO and maritime priorities"
    ],
    "sources": [
      "IMO official website (imo.org)",
      "UN documents on sustainable development and oceans (SDG 14)",
      "ORF / IDSA papers on maritime governance",
      "The Hindu / Indian Express editorials on marine pollution, maritime safety",
      "Yojana / Kurukshetra articles on blue economy and maritime affairs"
    ],
    "answer_framework": {
      "intro": "Highlight the centrality of oceans in global ecology, economy, and human life – and the need for global governance.",
      "body": {
        "part1": "Explain IMO’s mandate and global role in regulating international shipping and maritime safety.",
        "part2": "Discuss major conventions and frameworks adopted under IMO to protect the marine environment.",
        "part3": "Mention India’s active participation and implications for maritime security and environmental compliance."
      },
      "conclusion": "As the guardian of oceans, IMO plays a crucial role in balancing growth and sustainability across global maritime domains."
    },
    "linked_current_issues": [
      "Carbon intensity targets and IMO’s decarbonisation strategy (MEPC resolutions)",
      "Shipping safety and oil spill responses",
      "India’s maritime ambitions under SAGAR and Indo-Pacific framework",
      "Debates on equity in IMO’s global emission reduction targets"
    ]
  }
]
